#include <iostream>
#include <Windows.h>
using namespace std;


//3.Дано 3 числа.Визначити чи є серед них додатні.
//4.Дано число.Визначити чи лежить воно за межами відрізків[2, 5] та[-1, 1].
//5.Дано три числа.Визначити чи рівні вони між собою.
//
//На додаткові бали :
//Завдання 1. Користувач вводить з клавіатури відстань
//до аеропорту і час, за який потрібно доїхати.Обчислити
//швидкість, з якою йому потрібно їхати.
//
//Завдання 2. Користувач вводить з клавіатури час початку
//і час завершення використання скутера(години, хвилини
//    та секунди).Порахувати вартість подорожі, якщо вартість
//    хвилини — 2 гривні.
//
//    Завдання 3. Користувач вводить з клавіатури відстань,
//    витрату бензину на 100 км і вартість трьох видів бензину.
//    Вивести на екран порівняльну таблицю з вартістю подо -
//    рожі на різних видах палива.

    void main()
{
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);
    //1.Дано сторони трикутника. Визначити якого вигляду це трикутник(рівносторонній, рівнобедрений, прямокутний).
    //float a, b, c;
    //cout << "Введіть першу сторону трикутника:" ;
    //cin >> a; 
    //
    //cout << "Введіть другу сторону трикутника:" ;
    //cin >> b;
    //
    //cout << "Введіть третю сторону трикутника:" ;
    //cin >> c;
   

    //if (a == b && a == c && b == c)
    //{
    //    cout << "Трикутник рівносторонній";
    //}
    //else if ((a == b )|| (b == c )|| (c == a ))
    //{
    //    cout << "Трикутник рівносторонній";
    //}
    //else if ((a*a+b*b==c*c) || (b*b + c*c == a*a) || (c*c + a*a == b*b) )
    //{
    //    cout << "Трикутник прямокутний";
    //}
    
    //2.Дано розміри цегли і отвору у стіні.Визначити чи цегла пройде у отвір.
    /*int brickLength, brickWidth, brickHeight;
    int holeLength, holeWidth, holeHeight;

    cout << "Введіть розміри цегли (довжина, ширина, висота): ";
    cin >> brickLength >> brickWidth >> brickHeight;

    cout << "Введіть розміри отвору (довжина, ширина, висота): ";
    cin >> holeLength >> holeWidth >> holeHeight;

    if (brickLength <= holeLength && brickWidth <= holeWidth && brickHeight <= holeHeight)
    {
        cout << "Цегла пройде у отвір." << endl;
    }
    else {
        cout << "Цегла не пройде у отвір." << endl;
    }*/
    //3.Дано 3 числа.Визначити чи є серед них додатні.
    /*int num1, num2, num3;

    cout << "Введіть три числа: ";
    cin >> num1 >> num2 >> num3;

    if (num1 > 0 || num2 > 0 || num3 > 0) {
        cout << "Є додатні числа серед введених." << endl;
    }
    else {
        cout << "Серед введених чисел немає додатніх." << endl;
    }*/
    //4.Дано число.Визначити чи лежить воно за межами відрізків[2, 5] та[-1, 1]
    //double number;

    /*cout << "Введіть число: ";
    cin >> number;

    if ((number < 2 || number > 5) && (number < -1 || number > 1)) {
        cout << "Число за межами відрізків [2, 5] та [-1, 1]." << endl;
    }
    else {
        cout << "Число в межах відрізків [2, 5] та [-1, 1]." << endl;
    }*/
    //5.Дано три числа.Визначити чи рівні вони між собою.

   /* int num1, num2, num3;

    cout << "Введіть три числа: ";
    cin >> num1 >> num2 >> num3;

    if (num1 == num2 && num2 == num3) {
        cout << "Всі три числа рівні між собою." << endl;
    }
    else {
        cout << "Числа не рівні між собою." << endl;
    }*/

    /*Завдання 1. Користувач вводить з клавіатури відстань
        до аеропорту і час, за який потрібно доїхати.Обчислити
        швидкість, з якою йому потрібно їхати.*/
    
        /*double distance, time;

        cout << "Введіть відстань до аеропорту (в кілометрах): ";
        cin >> distance;

        cout << "Введіть час, за який потрібно доїхати (в годинах): ";
        cin >> time;

        double speed = distance / time;

        cout << "Вам потрібно їхати зі швидкістю " << speed << " км/год." << endl;*/

        //Завдання 2. Користувач вводить з клавіатури час початку  і час завершення використання скутера(години, хвилини та секунди).Порахувати вартість подорожі, якщо вартість хвилини — 2 гривні.

        /*int startHour, startMinute, startSecond;
        int endHour, endMinute, endSecond;
        const double costPerMinute = 2.0;

        cout << "Введіть час початку використання скутера (години хвилини секунди): ";
        cin >> startHour >> startMinute >> startSecond;

        cout << "Введіть час завершення використання скутера (години хвилини секунди): ";
        cin >> endHour >> endMinute >> endSecond;

        int startTimeInSeconds = startHour * 3600 + startMinute * 60 + startSecond;
        int endTimeInSeconds = endHour * 3600 + endMinute * 60 + endSecond;

        int durationInSeconds = endTimeInSeconds - startTimeInSeconds;
        int durationInMinutes = durationInSeconds / 60;

        double totalCost = durationInMinutes * costPerMinute;

        cout << "Вартість подорожі: " << totalCost << " грн" << endl;*/

        //Завдання 3. Користувач вводить з клавіатури відстань, витрату бензину на 100 км і вартість трьох видів бензину. Вивести на екран порівняльну таблицю з вартістю подорожі на різних видах палива.
        double distance, fuelPer100, price1, price2, price3;

        cout << "Введіть відстань (км): ";
        cin >> distance;

        cout << "Введіть витрату бензину на 100 км: ";
        cin >> fuelPer100;

        cout << "Введіть вартість бензину 1 (грн/л): ";
        cin >> price1;

        cout << "Введіть вартість бензину 2 (грн/л): ";
        cin >> price2;

        cout << "Введіть вартість бензину 3 (грн/л): ";
        cin >> price3;

        double cost1 = (distance / 100) * fuelPer100 * price1;
        double cost2 = (distance / 100) * fuelPer100 * price2;
        double cost3 = (distance / 100) * fuelPer100 * price3;

        cout << "Порівняльна таблиця вартості подорожі:" << endl;
        cout << "--------------------------------------" << endl;
        cout << "Вид бензину: Вартість подорожі (грн)" << endl;
        cout << "--------------------------------------" << endl;
        cout << "Бензин 1:    " << cost1 << " грн" << endl;
        cout << "Бензин 2:    " << cost2 << " грн" << endl;
        cout << "Бензин 3:    " << cost3 << " грн" << endl;
    }
