#include <iostream>
#include <Windows.h>
using namespace std;


//3.Дано 3 числа.Визначити чи є серед них додатні.
//4.Дано число.Визначити чи лежить воно за межами відрізків[2, 5] та[-1, 1].
//5.Дано три числа.Визначити чи рівні вони між собою.
//
//На додаткові бали :
//Завдання 1. Користувач вводить з клавіатури відстань
//до аеропорту і час, за який потрібно доїхати.Обчислити
//швидкість, з якою йому потрібно їхати.
//
//Завдання 2. Користувач вводить з клавіатури час початку
//і час завершення використання скутера(години, хвилини
//    та секунди).Порахувати вартість подорожі, якщо вартість
//    хвилини — 2 гривні.
//
//    Завдання 3. Користувач вводить з клавіатури відстань,
//    витрату бензину на 100 км і вартість трьох видів бензину.
//    Вивести на екран порівняльну таблицю з вартістю подо -
//    рожі на різних видах палива.

void main()
{
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);
    //1.Дано сторони прямокутника. Визначити чи прямокутник є квадратом.
    /*float a, b;
    cout << "Введіть першу сторону прямокутника:" ;
    cin >> a; 
    
    cout << "Введіть другу сторону прямокутника:" ;
    cin >> b;
    


    if (a == b)
    {
        cout << "Прямокутник є квадратом";
    }
    else 
    {
        cout << "Прямокутник не є квадратом";
    }*/

    //Дано вік дитини. Виначити чи дитина по віку може навчатися у школі, чи може відвідувати дитсадок і т.і.
    /*float age;
    cout << "Скільки дитині повних років:";
    cin >> age; 



    if (age <= 3 && age <= 5)
    {
        cout << "Дитина ходить в дитячий садочок";
    }
    else if (age <= 6 && age <= 15)
    {
        cout << "Дитина навчається в школі";
    }
    else if (age <= 16 && age <= 18)
    {
        cout << "Дитина навчається в школі або коледжі";
    }
    else if (age > 18 && age <= 25)
    {
        cout << "Дитина навчається у вищій школі або працює";
    }
    else
    {
        cout << "Мама з дитиною в декреті";
    }*/

    
    //Дано 3 числа. Визначити чи рівно два серед них від’ємні.
    /*int num1, num2, num3;

    cout << "Введіть три числа: ";
    cin >> num1 >> num2 >> num3;

    if (num1 < 0 && num2 < 0 || num3 < 0 && num1 < 0 || num3 < 0 && num2 < 0) {
        cout << "Є два відємних числа серед введених." << endl;
    }
    else {
        cout << "Серед введених чисел немає двох від'ємних чисел." << endl;
    }*/
    //4.Дано число. Визначити чи належить воно відрізку [2, 5] або [-1, 1].
    /*double number;  
    

    cout << "Введіть число: ";
    cin >> number;

    if ((number > 2 || number < 5) && (number > -1 || number < 1)) {
        cout << "Число за межами відрізків [2, 5] та [-1, 1]." << endl;
    }
    else {
        cout << "Число в межах відрізків [2, 5] та [-1, 1]." << endl;
    }*/
   //5.Дано три числа. Визначити чи тільки два з них рівні між собою.

   /*int num1, num2, num3;

    cout << "Введіть три числа: ";
    cin >> num1 >> num2 >> num3;

    if (num1 ==  num2  || num3 == num1 || num3 == num2) {
        cout << "Є два  числа рівні між собою." << endl;
    }
    else {
        cout << "Числа не рівні між собою." << endl;
    }*/

    //6.Дано 3 числа.Визначити чи всі числа непарні.Числа вводяться з клавіатури

    //int num1, num2, num3;

    //cout << "Введіть три числа: ";
    //cin >> num1 >> num2 >> num3;

    //if (num1%2  != 0 && num2 % 2 != 0 && num3%2 != 0) {
    //    cout << "Всі числа непарні." << endl;
    //}
    //else {
    //    cout << "Серед чисел є парні." << endl;
    //}

    ///*7.Дано два числа. Якщо вони різні, то поміняти іх місцями.*/
    //float a, b, temp;

    //    cout << "Введіть перше число: ";
    //    cin >> a;

    //    cout << "Введіть друге число: ";
    //    cin >> b;

    //    if (a != b) 
    //    {
    //        temp = a;
    //        a = b;
    //        b = temp;
    //    }

    //    cout << "Змінили значення чисел. а=" << a << ", b= " << b << endl;

    //8.Дано натуральне число а (а > 100 && a<999). Напишіть програму, що визначає кількість цифр в цьому числі, суму його цифр, і яка виводить на екран першу и останню цифру через два пропуски. 777 = 3 числа, сума, сума = 21

    int a;    

    cout << "Введіть тризначне число: ";
    cin >> a;
    if (a <= 100 || a >= 999) {
        cout << "Число має бути в діапазоні від 100 до 999" << endl;       
    }
    else 
    {
        int hundreds = a / 100;
        int tens = (a / 10) % 10;
        int units = a % 10;

        cout << "Cума цифр: " << hundreds + tens + units << endl;
        cout << hundreds << "  " << units << endl;
    }

    
//9.Дано час(години, хвилини, секунди).Визначити чи час допустимий(наприклад, 25.61.60 – недопустимий).

    /*int hours, minutes, seconds; 
    cout << "Введіть години: ";
    cin >> hours;
    cout << "Введіть хвилини: ";
    cin >> minutes;
    cout << "Введіть секунди: ";
    cin >> seconds;
   
    bool isValid = true;
    if (hours < 0 || hours >= 24) {
        isValid = false;
    }
    if (minutes < 0 || minutes >= 60) {
        isValid = false;
    }
    if (seconds < 0 || seconds >= 60) {
        isValid = false;
    }
   
    if (isValid) {
        cout << "Час допустимий." << endl;
    }
    else {
        cout << "Час недопустимий." << endl;
    }*/

    //10.Написати програму яка в залежності від введеної години виводить : good night, good day, good evening, good morning.
    /*int hours; 
    cout << "Введіть годину (0-23): ";
    cin >> hours;
  
    if (hours < 0 || hours > 23) {
        cout << "Неправильний формат години. Введіть значення від 0 до 23." << endl;       
    }
    else 
    {
        if (hours >= 0 && hours < 6) {
            cout << "Good night" << endl;
        }
        else if (hours >= 6 && hours < 12) {
            cout << "Good morning" << endl;
        }
        else if (hours >= 12 && hours < 18) {
            cout << "Good day" << endl;
        }
        else {
            cout << "Good evening" << endl;
        }
    }*/
    //11.Написати програму, яка обчислює та виводить мінімум з трьох введених користувачем чисел
    int num1, num2, num3;
    cout << "Введіть три числа:" << endl;
    cout << "Перше число: ";
    cin >> num1;
    cout << "Друге число: ";
    cin >> num2;
    cout << "Третє число: ";
    cin >> num3;

    int minNum = num1;
    if (num2 < minNum) {
        minNum = num2;
    }
    if (num3 < minNum) {
        minNum = num3;
    }

    cout << "Мінімальне число: " << minNum << endl;

}
